backend/controllers/AuthController.php

SELECT * FROM `ym_auth_item` WHERE `type`=2 ORDER BY `created_at`
---
    public function actionRoute(){

        $auth = AuthItem::find()->where(['type'=>2])->orderBy('created_at')->asArray()->all();