backend/controllers/BaseController.php

SELECT * FROM `ym_category`
---
    public function init()
    {
        $params = Category::find()->asArray()->all();