backend/controllers/CommentController.php

SELECT COUNT(*) FROM `ym_comments` LEFT JOIN `ym_goods` ON `ym_comments`.`goods_id` = `ym_goods`.`id` LEFT JOIN `ym_user` ON `ym_comments`.`user_id` = `ym_user`.`id` WHERE `type`='2'
SELECT * FROM `ym_goods` WHERE `id` IN ('250', '5', '1', '6')
SELECT * FROM `ym_user` WHERE `id` IN ('1', '3')
SELECT `ym_comments`.* FROM `ym_comments` LEFT JOIN `ym_goods` ON `ym_comments`.`goods_id` = `ym_goods`.`id` LEFT JOIN `ym_user` ON `ym_comments`.`user_id` = `ym_user`.`id` WHERE `type`='2' LIMIT 10
---
    public function actionList(){
        $query = Comments::find()
            ->filterWhere(
                [
                    Comments::tableName().'.id' =>Yii::$app->request->post('id'),
                    'comment'   =>Yii::$app->request->post('comment'),
                    'type'    =>Yii::$app->request->post('type'),
                    'created_at'=>Yii::$app->request->post('created_at'),
                    'updated_at'=>Yii::$app->request->post('updated_at'),
                    User::tableName().'.username'   =>Yii::$app->request->post('username'),
                    User::tableName().'.login_ip'   =>Yii::$app->request->post('login_ip'),
                    Goods::tableName().'.title'   =>Yii::$app->request->post('title'),
                ]
            )
            ->joinWith('goods')
            ->joinWith('users')
            ->asArray();

        $count = clone $query;

        $pages = new Pagination(['totalCount'=>$count->count(),'pageSize'=>\Yii::$app->params['PageSize']]);

        $model = $query->offset($pages->offset)->limit($pages->limit)->all();

SELECT * FROM `ym_comments` WHERE `id`=4
UPDATE `ym_comments` SET `type`=2, `updated_at`=1486733668 WHERE `id`=4
UPDATE `ym_comments` SET `type`=1, `updated_at`=1486735696 WHERE `id`=15
---
    public function actionUpview(){

        $id   = (int)Yii::$app->request->get('id');
        $type = (int)Yii::$app->request->get('type');
        $model = Comments::findOne(['id'=>$id]);
        $success = ['status'=>'success','msg'=>'状态修改成功'];
        $error = ['status'=>'error','msg'=>'状态修改失败'];
        switch ($type){
            case 1:
                $model->type=2;
                if($model->save()){
                    return json_encode($success);
                };
                break;
            case 2:
                $model->type=1;
                if($model->save()){

SELECT * FROM `ym_comments` WHERE `id`=8
DELETE FROM `ym_comments` WHERE `id`=8
---
    public function actionDel(){
        Yii::$app->response->format = Response::FORMAT_JSON;
        $success = ['status'=>'success','msg'=>'删除评论成功'];
        $error = ['status'=>'error','msg'=>'删除评论成功'];
        $id   = (int)Yii::$app->request->get('id');
        $model = Comments::findOne(['id'=>$id]);
        if($model->delete()){

UPDATE `ym_comments` SET `type`=1 WHERE id=21
---
    public function actionUpall(){
        Yii::$app->response->format=Response::FORMAT_JSON;
        $success = ['status'=>1,'msg'=>"操作成功"];
        $error   = ['status'=>0,'msg'=>"操作失败"];
        if(Yii::$app->request->isPost){
            $ids = Yii::$app->request->post('id');
            $list = explode(',',$ids);
            $trans = Yii::$app->db->beginTransaction();
            try{
                foreach ($list as $v){
                    Comments::updateAll(['type'=>1],'id='.$v.'');