backend/controllers/ConfigController.php

    public function actionWebconf(){

        $model = Conf::find()->where(['type'=>1])->asArray()->all();
---
SELECT * FROM `ym_conf` WHERE `type`=1