backend/controllers/GoodsController.php

SELECT `ym_category`.* FROM `ym_category` LEFT JOIN `ym_category` `new` ON `ym_category`.`pid` = `new`.`id`
---
    public function actionCate(){
        $model = Category::find()->joinWith('childs')->asArray()->all();

SELECT * FROM `ym_category` `new` WHERE `id`='0'
---
    public function actionAddcate(){
        $arr = Category::find()->asArray()->all();