backend/controllers/MenuController.php

SELECT * FROM `ym_menu` `list` WHERE `id` IN ('0', '2', '1', '13')
SELECT `ym_menu`.* FROM `ym_menu` LEFT JOIN `ym_menu` `list` ON `ym_menu`.`pid` = `list`.`id` WHERE `ym_menu`.`type`=1 LIMIT 7
---
    public function actionList(){
        //获取参数和innerJoin时候添加表前缀
        $query   = Menu::find()->filterWhere([
            Menu::tableName().'.type'=>1,
            Menu::tableName().'.name'=>Yii::$app->request->post('name'),
            Menu::tableName().'.route'=>Yii::$app->request->post('route'),
            Menu::tableName().'.order'=>Yii::$app->request->post('order'),
            Menu::tableName().'.visiable'=>Yii::$app->request->post('visiable'),
        ]);
        $countQuery= clone $query;
        $pages = new Pagination(['totalCount'=>$countQuery->count(),'pageSize' =>7]);
        $models = $query->joinWith('subMenu')->offset($pages->offset)
                  ->limit($pages->limit)
                  ->all();