backend/controllers/OpraterController.php

SELECT COUNT(*) FROM `ym_log` ORDER BY `created_at` DESC
SELECT * FROM `ym_log` ORDER BY `created_at` DESC LIMIT 10
---
    public function actionList(){
        $query = Log::find()
                ->filterWhere([
                    'oprater'=>\Yii::$app->request->post('oprater'),
                    'tablename'=>\Yii::$app->request->post('tablename'),
                    'methods'=>\Yii::$app->request->post('methods'),
                    'ip'=>\Yii::$app->request->post('ip'),
                    'url'=>\Yii::$app->request->post('url'),
                ])
                ->orderBy(['created_at'=>SORT_DESC])
                ->asArray();

        $count = clone $query;

        $pages = new Pagination(['totalCount'=>$count->count(),'pageSize'=>\Yii::$app->params['PageSize']]);

        $models = $query->offset($pages->offset)->limit($pages->limit)->all();

SELECT * FROM `ym_log` WHERE `id`=189
---
    public function actionSee(){
        $this->layout= false;
        $id = \Yii::$app->request->get('id');
        $models = Log::find()->where(['id'=>(int)$id])->asArray()->one();