backend/controllers/SingleController.php

    public function actionList()
    {
        $model = Singlepage::find()->orderBy(['created_at'=>SORT_DESC])->asArray()->all();
---
SELECT * FROM `ym_singlepage` ORDER BY `created_at` DESC