backend/controllers/SuggestController.php

    public function actionList(){

        $query = Suggest::find()
            ->filterWhere(
                [
                    'id' =>Yii::$app->request->post('id'),
                    'content'   =>Yii::$app->request->post('content'),
                    'type'    =>Yii::$app->request->post('type'),
                    'created_at'=>Yii::$app->request->post('created_at'),
                    'updated_at'=>Yii::$app->request->post('updated_at'),
                    'nickname'   =>Yii::$app->request->post('username'),
                    'email'   =>Yii::$app->request->post('email'),
                    'oprater'   =>Yii::$app->request->post('oprater'),
                ]
            )
            ->orderBy(['created_at'=>SORT_DESC])
            ->asArray();

        $count = clone $query;

        $pages = new Pagination(['totalCount'=>$count->count(),'pageSize'=>\Yii::$app->params['PageSize']]);

        $model = $query->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT COUNT(*) FROM `ym_suggest` ORDER BY `created_at` DESC
SELECT * FROM `ym_suggest` ORDER BY `created_at` DESC LIMIT 10