backend/controllers/UserController.php

    public function actionList(){
        $query = AdminUser::find()->filterWhere([
            'username'    =>Yii::$app->request->post('name'),
            'email'   =>Yii::$app->request->post('email'),
            'sex'     =>Yii::$app->request->post('sex'),
            'qq'      =>Yii::$app->request->post('qq'),
            'phone'   =>Yii::$app->request->post('phone'),
            'status'  =>Yii::$app->request->post('status'),
            'login_ip'=>Yii::$app->request->post('login_ip'),
        ]);
        $count =clone $query;
        $pages = new Pagination(['totalCount'=>$count->count(),'pageSize'=>Yii::$app->params['PageSize']]);
        $model = $query
                ->offset($pages->offset)
                ->limit($pages->limit)
                ->all();
---
SELECT COUNT(*) FROM `ym_adminuser`
SELECT * FROM `ym_adminuser` LIMIT 10