backend/views/layouts/_menu.php

use common\helpers\FormatArray;


$sql = Menu::find()->where(['type'=>1,'visiable'=>1])->orderBy('order',SORT_ASC)->asArray()->all();
---
SELECT * FROM `ym_menu` WHERE (`type`=1) AND (`visiable`=1) ORDER BY `order`