common/models/AdminUser.php

    public static function findByUsername($user){

        return static::findOne(['username'=>$user,'status'=>self::USER_ACTIVE]);
---
SELECT * FROM `ym_adminuser` WHERE (`username`='wangmazi') AND (`status`=10)

    public static function findByEmail($user){
        return static::findOne(['email'=>$user,'status'=>self::USER_ACTIVE]);
---
SELECT * FROM `ym_adminuser` WHERE (`email`='1791502202@qq.com') AND (`status`=10)

    public static function findIdentity($id)
      {
         return static::findOne(['id'=>$id, 'status' => self::USER_ACTIVE]);
---
SELECT * FROM `ym_adminuser` WHERE (`id`='1') AND (`status`=10)