backend/models/GoodsForm.php

    public function addHandle(){

        //开启事务
        $trans = Yii::$app->db->beginTransaction();
        try{
            $goods = new Goods();
            $goods->title = $this->title;
            $goods->cateid = $this->cateid;
            $goods->num   = $this->num;
            $goods->shopprice = $this->shopprice;
            $goods->marketprice=$this->marketprice;
            $goods->trueprice = $this->trueprice;
            $goods->words  = $this->words;
            $goods->detail = $this->detail;
            $goods->package = $this->package?:'';
            $goods->material= $this->material?:'';
            $goods->value  = $this->value?:'';
            $goods->object = $this->object?:'';
            $goods->models = $this->models?:'';
            $goods->color  = $this->color?:'';
            $goods->holiday= $this->holiday?:'';
            $goods->isshow = $this->isshow?:10;
            $goods->istime = $this->istime?:1;
            $goods->isbanner = $this->isbanner?:1;

            $im = array_values(array_unique(explode('|',$this->images)));
            $goods->midimg = $im[0];
            $goods->smimg1 = $im[1];
            $goods->smimg2 = isset($im[2])?$im[2]:'';
            if(!$goods->save()){
---
INSERT INTO `ym_goods` (`title`, `cateid`, `num`, `shopprice`, `marketprice`, `trueprice`, `words`, `detail`, `package`, `material`, `value`, `object`, `models`, `color`, `holiday`, `isshow`, `istime`, `isbanner`, `midimg`, `smimg1`, `smimg2`, `created_at`, `updated_at`) VALUES ('海澜之心', 2, 200, 1688, 1688, 200, '我爱你从见到你的上个世纪，我爱你直到我离去的那个世纪，我不会说永远，但爱你的期限总是比永远多一天！', '精选99朵优质蓝玫瑰，栀子叶围边。', '蓝色瓦楞纸圆形包装，美丽蝴蝶结束扎。', '13', 11, 1, NULL, 9, 3, 10, 10, 1, 'uploads/20170125/201701250437476627.jpg', 'uploads/20170125/201701250437478351.jpg', 'uploads/20170125/201701250437474535.jpg', '1485319084', '1485319084')

    protected function addContent($event){
        $id = $event->data['id'];
        $con = new Detail();
        $con->goods_id = $id;
        $con->content = $this->content;
        if(!$con->save()){
---
INSERT INTO `ym_detail` (`goods_id`, `content`) VALUES (7, '<p>[材 料]</p><p>精选99朵优质蓝玫瑰，栀子叶围边。</p><p>[包 装]</p><p>蓝色瓦楞纸圆形包装，美丽蝴蝶结束扎。</p><p>[花 语]</p><p>我爱你从见到你的上个世纪，我爱你直到我离去的那个世纪，我不会说永远，但爱你的期限总是比永远多一天！</p><p>[适合场合]</p><p>爱意表达 生日 祝福 道歉 婚礼 求婚</p>')