backend/views/goods/_attribute.php

 * @see https://github.com/craftsmann.
 * @author craftsmann <m13993334619@163.com>
 */
$val = \common\models\Value::find()->asArray()->all();
$mat = \common\models\Material::find()->asArray()->all();
$obj = \common\models\Object::find()->asArray()->all();
$col = \common\models\Color::find()->asArray()->all();
$hol = \common\models\Holiday::find()->asArray()->all();
---
SELECT * FROM `ym_value`
SELECT * FROM `ym_material`
SELECT * FROM `ym_object`
SELECT * FROM `ym_color`
SELECT * FROM `ym_holiday`